[{"id":"5251490207","userName":"Fu2oonfahad","userUrl":"https://itunes.apple.com/us/reviews/id1108728583","version":"1.165.2","score":5,"title":"Rate this game","text":"Good game I like it","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5251087553","userName":"tlcgagirl","userUrl":"https://itunes.apple.com/us/reviews/id880954978","version":"1.165.2","score":2,"title":"Don’t Purchase","text":"I been playing this game forever off & on according to my breaks from life Anyways I decided to make a purchase for my first time I was supposed to get 22 gold bars for $1.99 & only got 5 & it tells me I haft to purchase 10 more gold bars to get extra moves. I actually wouldn’t mind doing another purchase if this game done right on the purchase I just made. Will not be purchasing anything else","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5251050632","userName":"marrythenight666","userUrl":"https://itunes.apple.com/us/reviews/id167394653","version":"1.165.2","score":1,"title":"Can’t reset the board upon opening level!","text":"Been playing since it’s debut on the App Store and the one thing i loved was being able to open a level and if I didn’t like it exit out and retry again with out losing a live and boosters. This new update has removed that feature and it will be almost impossible to beat levels with out the use of seeing what the level is like. Fix ASAP pls this is not fair to players that have been here for years!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5251013615","userName":"Seastmisc","userUrl":"https://itunes.apple.com/us/reviews/id17805637","version":"1.165.2","score":1,"title":"Did you think people were enjoying the game too much?","text":"Seriously what were they thinking with this latest patch? That people were enjoying the game too much so they had to make it less so? Not being able to close out a game before making a move and losing a life was a stupid move. I’m past level 5000 and have little inclination to continue. Not spending the money that’s for sure. You’ve gone from getting the periodic purchase from me to no spending at all. Giving up on this until you get wise and go back to the way things were. Don’t mind a hard game but this takes it to the level of waste of time.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5250737045","userName":"el guanaco🌈🇸🇻🇸🇻","userUrl":"https://itunes.apple.com/us/reviews/id593761557","version":"1.165.2","score":5,"title":"El mejor juego","text":"Me encanta por q me quita el estrés","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5250717144","userName":"Deahjab","userUrl":"https://itunes.apple.com/us/reviews/id499554708","version":"1.165.2","score":1,"title":"THE UPDATE","text":"Go back to the old update the new one is trash","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5250525452","userName":"Mouse-9898","userUrl":"https://itunes.apple.com/us/reviews/id1108641713","version":"1.165.2","score":5,"title":"This is SOOOOO fun!","text":"I am in love with this game it’s just so addicting! My mom is like on level 735 because she loves it so much. It gives you something to do when your bored and fun on road trips! But over all it’s just so fun, if you read this review and you don’t have the game then you should totally get the app and I love all the designs the little things you can use to help you beat the level😊👍","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5250394168","userName":"Harleyfb67","userUrl":"https://itunes.apple.com/us/reviews/id194109630","version":"1.165.2","score":1,"title":"No more reset ability - I’m done","text":"Starting yesterday, I’m no longer able to exit and restart a level with a more favorable board without losing a life. Obviously this is intended to force people to pay for lives or boosters. Nope. Instead I’m done and will be deleting the app for good.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5250286651","userName":"Moose_Dude","userUrl":"https://itunes.apple.com/us/reviews/id304574913","version":"1.165.2","score":5,"title":"Crush-a-holic","text":"Love candy crush. At the end of the road. I have hit the jackpot twice spinning the wheel. Actually happened two times in a row. Keep on crushing!!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5250248712","userName":"Bighair1989","userUrl":"https://itunes.apple.com/us/reviews/id18681490","version":"1.165.2","score":1,"title":"Bring back board reset or I’m done","text":"Been playing this game for 7 years. I don’t mind buying boosters and the piggy bank but I’m not spending one more dime til you bring back the opportunity to reset a board.  Not spending any money to buy my way off of a board that I can’t even reset and use my boosters how I want to. \nI’ll find a new game","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5250025863","userName":"wooddinho","userUrl":"https://itunes.apple.com/us/reviews/id561538621","version":"1.165.2","score":5,"title":"Saga crush","text":"C est un jeu très amusant je l aime","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5249961374","userName":"grenadesbro","userUrl":"https://itunes.apple.com/us/reviews/id160318963","version":"1.165.2","score":1,"title":"Let me restart levels again","text":"Please. This isn’t fairnto new players especially","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5249653569","userName":"please heop me candy crush","userUrl":"https://itunes.apple.com/us/reviews/id943001479","version":"1.165.2","score":1,"title":"Disgusting","text":"I lost my progress and it won't let me switch my Facebook account to retrieve my account.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5249450837","userName":"Stanley-J","userUrl":"https://itunes.apple.com/us/reviews/id269545630","version":"1.165.2","score":1,"title":"Latest Update is Killing the Golden Goose","text":"MAJOR MISTAKE by King in latest update will kill their Golden Goose. Cannot reset board without losing a life removes player options to change strategy and forces you to buy more Boosts. \nHave stopped playing Candy Crush in frustration. I’m sure others will do the same, once they hit this wall.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5249447541","userName":"freefall stuck","userUrl":"https://itunes.apple.com/us/reviews/id354634734","version":"1.165.2","score":5,"title":"Level 2611","text":"Love the game but level 2611 with 12 moves,really! Please fix!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5249377723","userName":"nananna-","userUrl":"https://itunes.apple.com/us/reviews/id1073152582","version":"1.165.2","score":2,"title":"I dont get the ad videos  for lives","text":"Everybody that i know plays candy crush get the ad video’s for lives and other things i dont get to watch the ads to bad candy crush cant do this for all players not just some im actually thinking about quitting the game because i dont think its fair","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5249018548","userName":"sjaiwheibsiqhsksa","userUrl":"https://itunes.apple.com/us/reviews/id141322794","version":"1.165.2","score":3,"title":"Done playing","text":"I have spent hours upon hours playing but with the latest updates I am done!  If you accidentally started a previous level you could back out without losing a life as long as you had not played a move yet!  Now someone in their greed and wisdom decided to take that out .  Hope your sponsors don't mind losing viewers.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5248833252","userName":"Bzzzness","userUrl":"https://itunes.apple.com/us/reviews/id32654664","version":"1.165.2","score":3,"title":"More stressful now.","text":"Ha. In your desire to make the game harder to push more purchases I think you’ve gone to far and simply made it too hard and more stressful. Some of the mindlessness is the point of playing and costing a life to refresh the board now also kind of pushed it over the end. Thanks","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5248804622","userName":"Pokiegirl1012443221","userUrl":"https://itunes.apple.com/us/reviews/id26314529","version":"1.165.2","score":5,"title":"Love it!","text":"Best way to be entertained.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5248717619","userName":"John Thompson's iPhone","userUrl":"https://itunes.apple.com/us/reviews/id276047787","version":"1.165.2","score":1,"title":"Board reset!","text":"Bring the board reset back!  It will probably lead me to leaving the game all together. So frustrating!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5248432308","userName":"JCTHIN","userUrl":"https://itunes.apple.com/us/reviews/id124320820","version":"1.165.2","score":1,"title":"Awful update","text":"Taking away the ability to restart the board without losing a life is BS. Get it together King","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5247233247","userName":"reverse this update please","userUrl":"https://itunes.apple.com/us/reviews/id279527396","version":"1.165.2","score":1,"title":"Nope","text":"I can not reset my game like I’ve always been able to without loosing a life. I am on level 1084, I guess that’s a good level to stop at.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5247229381","userName":"Indianolaknitter","userUrl":"https://itunes.apple.com/us/reviews/id232266635","version":"1.165.2","score":1,"title":"What happened????","text":"You took away the ability to exit out of a game, if you haven’t started playing yet, without losing one of the 5 games. Bad decision. Limits play substantially.  That’s ok. There plenty of other games to play. I’ll be choosing another one.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5246965822","userName":"60games","userUrl":"https://itunes.apple.com/us/reviews/id198294292","version":"1.165.2","score":5,"title":"Yes, but","text":"Lots of changes lately. The newest one I’ve been dreading: no more restarts without losing a life. Sometimes you can look at a game and know you don’t have a chance. Now there’s no choice but to play the game as it comes up. Good luck everyone. I’ve been playing for years and only hit the jackpot on the wheel once - it’s rigged. More hammers and switches please.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5246842386","userName":"boyyoucantgetthis","userUrl":"https://itunes.apple.com/us/reviews/id680972428","version":"1.165.2","score":5,"title":"I would like to get my spot back","text":"I can’t log on to my old game","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5246443403","userName":"Meerykat","userUrl":"https://itunes.apple.com/us/reviews/id153030196","version":"1.165.2","score":1,"title":"Fun initially","text":"Now you can’t exit a level without losing a life? Sometimes I wanna exit and start with a booster but now I gotta lose a life for it? Wild how they updated this feature when I haven’t even updated the app? Lol what demons... oh well I’ve never spent a penny on this game and I never will. They took away the extra spins if you don’t pass a level as if giving 9 moves to clear 67 jelly is so simple. Probably gonna delete this garbage unless they change some features to actually benefit the player...","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5246133748","userName":"bapohl","userUrl":"https://itunes.apple.com/us/reviews/id29466281","version":"1.165.2","score":1,"title":"Used to be a great app...","text":"I have been playing candy crush since it first came out.  In the beginning, it was a slick, solid, clever game that was immediately addictive. But over the last few years it has become a bloated, confusing mess, with a non-sensical number of challenges that you cannot opt out of, and requiring an ever-increasing number of clicks to progress from the end of one game to the beginning of the next.  The developers are clearly focused on manipulating the rules and supposed “random” elements of the game (e.g. the end of game wheel spin for additional moves, or the daily booster wheel spin) to drive increased in-app purchases.  The nail in the coffin for me was the recent decision to eliminate the ability to restart a game without penalty prior to making your first move.  I now continually burn boosters that get placed in unusable spots, as I cannot reshuffle the board without losing a life. This makes the game unplayable at higher levels, unless you are willing to spend a lot of money on booster purchases. \n\nI am done.  I will now move on to other games.  If I hear that King reverses their “fix” to penalize restarts, I may reconsider.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245771183","userName":"Kaop157934","userUrl":"https://itunes.apple.com/us/reviews/id31721835","version":"1.165.2","score":1,"title":"Terrible update!","text":"Like many who have recently written, I too find the newest update to be a bad move.  It’s absolutely awful. Losing a life because you exit out is ridiculous. I shudder to think how much I have spent on buying extra lives over the years, but no more!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245768733","userName":"Jan lady bug","userUrl":"https://itunes.apple.com/us/reviews/id386689842","version":"1.165.2","score":5,"title":"Awesome","text":"Love t","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245760815","userName":"Mxqz","userUrl":"https://itunes.apple.com/us/reviews/id156359258","version":"1.165.2","score":2,"title":"Making the game harder for everyone","text":"It takes a special kind of stupid to think making the game harder for everyone is an improvement. Congratulations to the developers for being special!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245602017","userName":"Jyeaplay","userUrl":"https://itunes.apple.com/us/reviews/id49201533","version":"1.165.2","score":1,"title":"Messed up core joy of the game","text":"Latest update ruined the game","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245594297","userName":")Oh)My","userUrl":"https://itunes.apple.com/us/reviews/id123014361","version":"1.165.2","score":1,"title":"Won’t be playing this anymore thanks to the latest update","text":"When I start a level but don’t like the layout I used to be able to exit and restart the level. Now exiting causes me to lose a life and any boosters. Nope. I’m done.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245584325","userName":"icefrog","userUrl":"https://itunes.apple.com/us/reviews/id37643179","version":"1.165.2","score":1,"title":"Ruined by updates","text":"Ruined by updates","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245560649","userName":"LaurynT.","userUrl":"https://itunes.apple.com/us/reviews/id175253369","version":"1.165.2","score":3,"title":"Latest Update???","text":"Love this game. Play it throughout the day when I’m bored or watching some Netflix. But the lastest update that doesn’t let you get out of a level that you haven’t made moves on is ruining the game. Sometimes I click the wrong level, use the wrong boosts, or just don’t have a good board. Please fix this.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245301081","userName":"777Law777","userUrl":"https://itunes.apple.com/us/reviews/id154830486","version":"1.165.2","score":1,"title":"Bring back ability to reset!!!","text":"I’m at level 5915 and waiting for new levels. I used to look forward to getting the new levels weekly on Wednesdays. Without the ability to reset, I don’t plan to continue.  The levels are hard enough with resetting. Hope Candy Crush admin listens to all the fury over this issue and change back.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245066712","userName":"Bsg221","userUrl":"https://itunes.apple.com/us/reviews/id108830850","version":"1.165.2","score":5,"title":"Fun","text":"Truly a nice way to unwind. But what’s with the jackpot slice on the daily booster wheel? I’ve had this game for years and play pretty regularly and I’ve never won it. Never met anyone who has. It’s a farce!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5245004275","userName":"\"name is taken\"","userUrl":"https://itunes.apple.com/us/reviews/id130535499","version":"1.165.2","score":1,"title":"Shame on the developers. I despise what you've done to this game!","text":"Back to ruining the game....Foolishly I keep hoping the next update of Candy Crush Saga will ratify of the damage the previous horrible ”updates” have done to the game. The developers have sucked out all the enjoyment of playing this game unless you're willing to pay a fortune to win a single level. I understand it's a business but the greed is distugisting.   Those in charge of these changes should be ashamed of yourselves. If ”you” started Candy Crush Saga out as this huge money hungry monster it has so quickly become that would have been one thing. I would have been aware of what I was walking into. I would never have spent a dime only to begin with only now to be left feeling robbed for all the money and time I've spent over the years when the prices and game levels play were fair. Your greed makes me eagerly play other games and smile when I make purchases to support their apps.\n\nNow you took away the “build-a-bot” from the previous levels! You must hate the people who have played for a while. You keep punishing us. \n\n2.99 for 30 gold bars... Are you kidding me!!! Thanks for saving me money since I won’t spend another dime on your app!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5244978258","userName":"BluebellKnapp","userUrl":"https://itunes.apple.com/us/reviews/id138243023","version":"1.165.2","score":1,"title":"Booster prices up 33 1/3 to 50%!!!","text":"I used to purchase boosters at least a couple times a week. NO MORE. When they jump pricing this much, they don’t deserve the money.\n\nNow they’ve changed so boosters are timed and the ones you get aren’t even useable in your current level. \n2019/12/06\nOpened game this evening and they’ve removed the ability to restart a game to get a better board. I’m done.   Going to uninstall immediately.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5244806987","userName":"CallMeBanker","userUrl":"https://itunes.apple.com/us/reviews/id283728002","version":"1.165.2","score":2,"title":"SuperBanker","text":"Company slowly ruined the game over the last twelve months -- if you've played, you'll know what I mean (or see other reviews). For those that haven't started playing the game, don't start (I wish someone told me 18 months ago). I'm actually happy they wrecked it so bad it got me to stop playing (3 days recovering). Anyway, best wishes if you do perhaps start playing (kiss your eyes goodbye).","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5244764887","userName":"ispypearson","userUrl":"https://itunes.apple.com/us/reviews/id175681922","version":"1.165.2","score":1,"title":"Why remove the replay feature?","text":"Removing the option to start a level again without losing a life was a really, really, really dumb idea. No thanks.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5244631712","userName":"MLC52790","userUrl":"https://itunes.apple.com/us/reviews/id155453790","version":"1.165.2","score":1,"title":"So disappointed in the reset feature","text":"The reset level feature has been changed. It used to be that you could reset the game by backing out before you made any moves until you had your special candies right where you wanted them. However, now you lose a life by backing out before you even make any moves. They have also done away with the wheel spin for extra moves and special candies for watching an ad. \nI have been a loyal player for 8 years. I loved that the game provided me with the option of paying or playing. I’ve made it all the way to level 4965 without ever paying. I don’t ever plan to pay. What kept me around was the choice to play using the free opportunities in the game (which have been taken away, as stated above). \nUnfortunately, now my game play will be limited and will ultimately cease because of these “new and improved fixes”. What a waste of 8 years worth of hard work... I do hope the developers read these comments and reverse the changes. It would show they actually care about their loyal consumers.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5244568406","userName":"Telling It Like It Is Player","userUrl":"https://itunes.apple.com/us/reviews/id127562039","version":"1.165.2","score":1,"title":"Never Again.....","text":"Never again will I play your game due to your recent update.  You now penalize the player and deduct a life for closing the game...BEFORE TAKING A MOVE. Yet, you claim this is how it was supposed to be...from when you first introduced the game???..THAT is unbelievable....Your loss.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5244490681","userName":"Md197021","userUrl":"https://itunes.apple.com/us/reviews/id39614803","version":"1.165.2","score":1,"title":"Worst update ever!","text":"I hope people sort these updates by most recent because they really need to see how everyone feels about the new update. Like most people, I’m finished playing unless recent changes are undone.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5244246003","userName":"A!!!!!!!!","userUrl":"https://itunes.apple.com/us/reviews/id37532855","version":"1.165.2","score":1,"title":"Reset functionality in last update","text":"So poor!  Recent update changed the ability to exit prior to first move, I am with everyone else, finally a reason to quit candy crush after thousands of levels.  All for the sake of updating the app, great job.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5243887366","userName":"Mahaan chennarddy","userUrl":"https://itunes.apple.com/us/reviews/id143471724","version":"1.165.2","score":5,"title":"The best game","text":"The best game ever really most stress relieving and relaxing so good to play","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5243716347","userName":"Eve0110","userUrl":"https://itunes.apple.com/us/reviews/id207629076","version":"1.165.2","score":2,"title":"Not longer just pass time","text":"This game was great! Just playing to pass time and release some stress. But now it’s like just annoying to get stuck in some boards ... you have to play over and over.. It’s no longer just a fun , mindless game. I’ve played for so many years and love most of the new changes. My color bombs explode when something else goes off and it’s not even close to the bomb. Ugh I can handle some changes.... but this losing a life when you exit the board and didn’t make any moves is just not cool. This might be the end of it for me.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5243618060","userName":"yerrrrx","userUrl":"https://itunes.apple.com/us/reviews/id1096991258","version":"1.165.2","score":1,"title":"THE NEW UPDATE IS TRASH","text":"Please bring back the option of leaving the game from the beginning without losing lives, I’m at level 3,000 and these levels are really hard to pass, at least knowing how the board looked like before the game helped me to make it this far, so if you don’t fix this new update I’ll simply stop playing since there is no point of paying for boosters or getting them as you advance in levels if you can’t choose how to distribute them by leaving and entering again. Hope you’ll realize this will decrease not only your users but also your sales since there’s no point in buying boosters if we don’t get to choose how they’re distributed.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5243568115","userName":"sbq112","userUrl":"https://itunes.apple.com/us/reviews/id336484015","version":"1.165.2","score":1,"title":"Trashhhh","text":"Why!? Why would you make us lose a life before we make any moves??? The game was working fine for years. Why screw it up. CHANGE IT BACK!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5243202787","userName":"The cat 60","userUrl":"https://itunes.apple.com/us/reviews/id427403644","version":"1.165.2","score":1,"title":"Game is about $$$","text":"Game is absurdly hard.  All about how much you are willing to spend to get past absurdly impossible levels.  Played one level 20+ times, never got close to a win.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5243073215","userName":"Chef1122","userUrl":"https://itunes.apple.com/us/reviews/id294626768","version":"1.165.2","score":1,"title":"Slow","text":"Have to wait for 10 different screens before you can advance to the next level","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"}]