[{"id":"5260455610","userName":"lorieb4","userUrl":"https://itunes.apple.com/us/reviews/id905322192","version":"1.165.2","score":1,"title":"King just changed the game in a bad way.","text":"King changed the game to take away the ability to preview a screen without losing a life.  Before, you could look at it and as long as you didn’t play it you could back out and the screen would reshuffle.  You could do it over and over until you found a favorable board. Why does this matter?  1.  You are forced to play every board no matter how disadvantaged.  2. If you are using boosters, they will be randomly placed and are frequently placed in areas that are they aren’t even accessible on the board. So you are not only just losing a life playing a bad board, you are losing your boosters too.  3.  If you accidentally enter the wrong level you are forced to play it. Sometimes my devices aren’t synced together and before it was easy to sign out and in to fb to sync them so you are on the correct level.  King changed that too and it is now much more complicated.  What King did was  make the game unwinnable as booster are no longer an effective way to surpass a level.  I’m still playing but no longer buying boosters.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5260360452","userName":"a former fan 3","userUrl":"https://itunes.apple.com/us/reviews/id229913728","version":"1.165.2","score":1,"title":"Can’t restart levels","text":"Loved the game until they took away the ability to restart levels without losing a life. Been playing for years but this change will make me stop playing if not fixed soon","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5260077063","userName":"glkdrtf","userUrl":"https://itunes.apple.com/us/reviews/id237252280","version":"1.165.2","score":1,"title":"Used to love","text":"I used to love candy crush. I made it to level 2479. You used to be able to reset your game board if you don’t make any moves and it wouldn’t take a life. Now if you choose to use any of your boosters the game will put them somewhere unusable and if you back out of the game you lose your booster and a life. I feel like this is a ploy to get people to spend money on packages but I can’t even do that because for some reason it won’t work. All other apps I have have no problem connecting to the store with my credit card. Some levels have become impossible and you just have to play until you maybe get lucky. Not fun anymore.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5259451464","userName":"jguiberteaux","userUrl":"https://itunes.apple.com/us/reviews/id934120053","version":"1.165.2","score":3,"title":"Cheating","text":"I play this game a lot but I have to delete now because the game is cheating us. It’s no longer a game of skill....U can’t win a level until the computer allows it. They steal boosters or set them off when u played nowhere near them!!! I’m almost to level 5000 but I can’t stand the cheating so this pass time is over on to words with friends or something","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5258275648","userName":"Landon224","userUrl":"https://itunes.apple.com/us/reviews/id1109341639","version":"1.165.2","score":4,"title":"Please bring it back!","text":"Ok so, I’ve been playing candy crush for about 6 years now I’ve stopped playing and joined back many times. There is a few minor bugs but I get that what games don’t have bugs. The game overall is very fun and entertaining however there is one thing I would like to come back. I want the old map back the new map is just kinda plain and blah I like how the old map was more spread out and just no kinda in a straight line and my family and friends have said the same thing so please candy crush developers bring it back! Thanks.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5258018696","userName":"RJAES","userUrl":"https://itunes.apple.com/us/reviews/id26166157","version":"1.165.2","score":1,"title":"All done","text":"Now that you’ve taken away the ability to reset the game board at will, I’m all done.  I’ve played for years- my family would say I was obsessed.  Not anymore.  The fam thanks you!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5257871287","userName":"Go ya I","userUrl":"https://itunes.apple.com/us/reviews/id1109305672","version":"1.165.2","score":5,"title":"Fun","text":"It's really fun.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5257527938","userName":"Meme Y","userUrl":"https://itunes.apple.com/us/reviews/id139894296","version":"1.165.2","score":4,"title":"New to game and love it but","text":"I wish when I start playing I knew what the object is so I can try and win. I just move blocks and whatever happens happens.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5257502377","userName":"Trishapgh","userUrl":"https://itunes.apple.com/us/reviews/id21021097","version":"1.165.2","score":2,"title":"Please bring back the ability to reset the board","text":"I’ve been playing this game for years. I took a break for a while because I got tired of being stuck on levels for 2 weeks. I came back a couple months ago to find a lot of great updates. But PLEASE bring back the ability to reset the board if you haven’t made a move! Otherwise all the boosters are pretty much useless. Thanks!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5257323088","userName":"Surfrat1215","userUrl":"https://itunes.apple.com/us/reviews/id121107653","version":"1.165.2","score":1,"title":"Addiction to this game is cured.","text":"You can’t reset the game anymore, color bombs go off when they’re not even close to exploding wrapped candys, and when I use a booster to start the game, it’s the only move you can make so you waste it right away. Go through all my lives under 5 minutes. Game is boring and aggravating. Done.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5256867755","userName":"TrapQueen13","userUrl":"https://itunes.apple.com/us/reviews/id262349536","version":"1.165.2","score":1,"title":"used to love this game ):","text":"Update: \nI went back to playing, not as much as I used to but it became somewhat fun again (even though I still spent 3-4 days on a level that was too hard without boosters). I made it to level 3778. Even though the levels were tough, the only thing that helped was RESETTING THE GAME BOARD!!! which we can no longer do. I finally think its time to delete candy crush. only will return if I can reset the board at the very least. the levels are already ridiculously hard so its not even a fun game anymore. \n\nPrevious: \n*scroll down to numbers to see issues*\nI’ve been playing candy crush for a couple years now and I’m a few thousand levels in already. I used to love this game so much!!! They even added the feature of matching the 4 candies (in a square shape) to get fish which I personally thought helped win levels so much. But recently they started changing things and I went from playing everyday for a couple hours to going days without touching it (HALF THE LEVELS ARE ALMOST IMPOSSIBLE NOW). Let me explain where things first started going bad in this game.\n\n1) FISH: After having the fish feature for idk how long, they took it off. It really sucked because I had started getting accustomed to planning my moves with the fish in mind and it helped with clearing the hard to reach squares on some levels & now those levels are super hard to pass. But it wasn’t the worst thing.\n\n2) HELMETS: at one point my helmets stopped working !!! one day i just couldn’t get helmets anymore & then the next day i went back & they have me the option again??? they have been fluctuating between working and not working for a while now & I noticed that if I don’t play for more than a couple hours, the helmets i had on the last level disappear- EVEN IF I DIDNT LOSE THE LAST LEVEL. it’s annoying wanting to play and then losing a level that was passable with a helmet\n\n3) MYSTERY CANDY LEVELS: you know those levels where u have to get a number of yellow candies (but there’s only like 3 in the whole level & you have to first destroy the mystery candy & then the yellow ones appear?) well they only give you the exact number of mystery candies to destroy as yellow ones you need to destroy (which is hard but not impossible) but recently when I destroy the mystery candies there’s a block or a chocolate that pops up instead of the yellow candies so basically there’s no way to win the level. I even tried the mystery candy booster to give me more chances to get yellow candies but literally only one extra one popped up the whole game & it’s made it impossible to pass the level. \n\nluckily i’ve saved a lot of boosters or else i’d be stuck like 30-40 levels back. what happens when I run out? \nthis used to be my favorite game to play after work or when I was bored but now I waste all my lives in the first 5 seconds & I honestly considered deleting the app because it’s not fun playing a game you can never win. \nwish the designers would go back to the old version.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5256785582","userName":"Webster woman","userUrl":"https://itunes.apple.com/us/reviews/id191685948","version":"1.165.2","score":5,"title":"Never gets old!","text":"Always a favorite!\nThanks","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5256308272","userName":"Silver Qtip","userUrl":"https://itunes.apple.com/us/reviews/id344917516","version":"1.165.2","score":3,"title":"Candy drops?","text":"What happened to the candy drops?","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5256212615","userName":"tvuvtfj","userUrl":"https://itunes.apple.com/us/reviews/id601726086","version":"1.165.2","score":4,"title":"🤗","text":"Fun","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5255981694","userName":"DY59","userUrl":"https://itunes.apple.com/us/reviews/id203523014","version":"1.165.2","score":1,"title":"Fed up & disgusted","text":"You took away the reset of the board & I’m officially done. If you use a booster it winds up a throwaway if you can’t select a board where it can be used productively. Fed up & disgusted.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5255701083","userName":"wootwoot79","userUrl":"https://itunes.apple.com/us/reviews/id1040285843","version":"1.165.2","score":1,"title":"Highly upset","text":"I am highly upset. I’ve had the same profile since I stead to restart and I was pass level 2590 playing this game years ago. All my information was lost and my profile is no longer showing. I have to start back at level one","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254942734","userName":"Sudokuness","userUrl":"https://itunes.apple.com/us/reviews/id309493439","version":"1.165.2","score":1,"title":"Problem connecting to FB","text":"Can’t connect to Facebook with newest update. It keeps telling me to sign in to Facebook first. I am already signed in. More updates and I still can’t connect to Facebook. Please put it back how it was before so I can connect. Missing a lot of features and used to send and receive lives from friends, but now u can’t do that. Doesn’t save my progress or boosters. Please fix this it’s becoming frustrating.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254734149","userName":"mydogisbrandy1","userUrl":"https://itunes.apple.com/us/reviews/id496523158","version":"1.165.2","score":5,"title":"Great Game","text":"Fun game!!! Real good time.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254618464","userName":"bendecida y afortunada","userUrl":"https://itunes.apple.com/us/reviews/id517015883","version":"1.165.2","score":5,"title":"Thanks","text":"Me gusta pero algo aditivo, yo ya lo había abierto.otra vez pero ahora me pide mi correo para ir al Facebook y no me acuerdo","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254524653","userName":"Marclinn1","userUrl":"https://itunes.apple.com/us/reviews/id802792822","version":"1.165.2","score":1,"title":"Long time player...but it’s time to stop","text":"So...now you can no longer reset the board without penalty? What’s the point of boosters if we are forced to use them when they line up in the most useless ways? The game is no longer fun. Relax and play candy? You guys just keep making the game more and more UNrelaxing. This is a billion dollar game. Why ruin a good thing?!! Well...it’s been fun but I’m done.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254520581","userName":"Taco Goblin","userUrl":"https://itunes.apple.com/us/reviews/id913827417","version":"1.165.2","score":3,"title":"It plays for you","text":"You get like 10 seconds to play per level and then the game just does it for you. Not difficult or fun.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254519983","userName":"kkristyna","userUrl":"https://itunes.apple.com/us/reviews/id645634869","version":"1.165.2","score":5,"title":"Hola","text":"Actualice la aplicación y no puedo abrirla ahora","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254343683","userName":"ostrich91","userUrl":"https://itunes.apple.com/us/reviews/id218720156","version":"1.165.2","score":3,"title":"Ads","text":"Take the koala habitat being burned off the ads! I play candy crush to escape reality and relax not to watch something that upsets me to the core. I’m aware of the terrible fires in Australia. Don’t need to see it on candy crush.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254228843","userName":"kntb@713","userUrl":"https://itunes.apple.com/us/reviews/id310680603","version":"1.165.2","score":1,"title":"Horrible Update — Bring back board reset!","text":"Bring back the ability to reset the board, without losing a life.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254176598","userName":"Linnie307","userUrl":"https://itunes.apple.com/us/reviews/id785430745","version":"1.165.2","score":2,"title":"Money grabbers","text":"I have loved this game until now.  Recent changes force you to spend money in order to progress.  I'm out at level 4700.  Going to another game app","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254135062","userName":"Jamie0126","userUrl":"https://itunes.apple.com/us/reviews/id636412345","version":"1.165.2","score":1,"title":"Suggestions","text":"What are the suggestions for if it sets you up to lose every single time?  Yes, I did it to see lol","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254020382","userName":"LTFERGY","userUrl":"https://itunes.apple.com/us/reviews/id22497963","version":"1.165.2","score":1,"title":"Error","text":"Did the update and now it won’t let me sign in. Says connection error. No reports on a fix. I’ve tried several things to no avail. How about a fix guy!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254007627","userName":"Mama S2.0","userUrl":"https://itunes.apple.com/us/reviews/id498159120","version":"1.165.2","score":5,"title":"Love candy!","text":"I love candy crush saga. I don’t love that I lost my progress when my phone crashed, but not their fault. One thing I would suggest is that when you “rank up” that the lives could be added to your current lives. It always seems to happen when lives are full.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254001349","userName":"bhdl3","userUrl":"https://itunes.apple.com/us/reviews/id176521298","version":"1.165.2","score":1,"title":"Can't give zero stars","text":"I hate when games require zero thought. You'll win when supposed to win and when the algorithm is against you, there is nothing you can do to win (except pay to win.) Even when you're thinking and strategizing at your best, it will cheat you out of your win. Any suggestions on a fun game that's not pay to play.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5254000882","userName":"dedrjhgffhhhbc","userUrl":"https://itunes.apple.com/us/reviews/id1050153480","version":"1.165.2","score":1,"title":"Cant reset board ruined game","text":"The game was fun how it was being able to reset u guys ruined the game.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253888276","userName":"Lkap29","userUrl":"https://itunes.apple.com/us/reviews/id30123750","version":"1.165.2","score":1,"title":"Money hungry became more evident with last update","text":"King has taken away the level reset without losing a life.  They did this once before and after complaints they put it back. Now they claim it was a fix and it was never the intention to allow level reset.  So, that begs the question - they are fixing something that they actually allowed once before?  No way will I spend any money moving forward.  I would much rather find a new game/app that is not made by money hungry King.  You’ve gotten too big for yourselves.  You’ve slowly take the fun out of candy crush all in the name of money.  Remember who got you where you are, I’ve read in your new forum that people are dropping you after this move.  Congrats on all your success on the backs of people who just wanted some fun, until you turned it into a money grabber.  Sad","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253871776","userName":"ALECISM","userUrl":"https://itunes.apple.com/us/reviews/id659168339","version":"1.165.2","score":2,"title":"NEED MORE BOOSTERS","text":"It’s very fun I will say that but it just makes me want to delete the whole app by not giving out more boosters who is going to keep spending money on a game that doesn’t even give you your boosters half of the time smh candy crush needs to stop being so stingy I’d play all day if I wasn’t stuck on one level with no possible way of winning except without a booster come on now","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253679345","userName":"kimmy99d","userUrl":"https://itunes.apple.com/us/reviews/id149279051","version":"1.165.2","score":5,"title":"Addictive","text":"Great game.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253607881","userName":"Alwaysinthetop100","userUrl":"https://itunes.apple.com/us/reviews/id142916124","version":"1.165.2","score":1,"title":"trash","text":"App is trash with new update.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253537562","userName":"nat. j13","userUrl":"https://itunes.apple.com/us/reviews/id21821479","version":"1.165.2","score":5,"title":"No adds!!!!!!!!!!!!!!","text":"This game is not only awesome AND free but his has no adds which is a major bonus because theses days it’s really hard to find a game with no adds. Like IMPOSSIBLE. I love this app it is so nice, cute, and friendly.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253369007","userName":"xyz2302","userUrl":"https://itunes.apple.com/us/reviews/id698071859","version":"1.165.2","score":2,"title":"Glitching","text":"Since does the game make you lose a life if you toggle between screens. Such as if a text messages comes through and when you go back to the game it has ended and you lose a turn? It’s frustrating as well as if you are about to start a game and change your mind you also lose a turn then. Is this a new design to the game?","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253240702","userName":"Bubbydaw","userUrl":"https://itunes.apple.com/us/reviews/id15033218","version":"1.165.2","score":5,"title":"Great match 3 game!","text":"I love this game!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253219127","userName":"junglistic","userUrl":"https://itunes.apple.com/us/reviews/id87280441","version":"1.165.2","score":1,"title":"Bye!","text":"Latest update ruined the game. Uninstalled.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253198599","userName":"pajmar","userUrl":"https://itunes.apple.com/us/reviews/id86538809","version":"1.165.2","score":1,"title":"Disappointed","text":"I purchased a bundle for $3.99 that includes 20 gold bars, one of each booster and one hour of each booster. In the past I purchased a bundle for $9.99 and never got it. After making the purchases I never received any of these. On top of that I am missing 19 gold bars I played hard to earn. I sent a couple of messages to Customer Service and never received a reply. I really cannot recommend purchasing anything from this game.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253110948","userName":"Gooze318","userUrl":"https://itunes.apple.com/us/reviews/id281701692","version":"1.165.2","score":1,"title":"Crashing after latest update","text":"App won’t open. Only load screen then crash. Please fix","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5253091982","userName":"pmcm19","userUrl":"https://itunes.apple.com/us/reviews/id594737605","version":"1.165.2","score":1,"title":"They ruined the game","text":"Until recently, it was possible to “reset” the game board without penalty. This is an essential feature at the higher, more difficult levels. \nThe vendor decided that this feature should be “fixed”. That is: eliminated. \n\nSo all the strategy is eliminated from the game.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5252968668","userName":"Marykdba","userUrl":"https://itunes.apple.com/us/reviews/id11988276","version":"1.165.2","score":3,"title":"Can no longer reset the board","text":"... without losing lives. I frequently exit a board before the first move if I don’t like the board I get. For example, if I have two color bombs available I reset the board until I get them next to each other. I have an iPhone. I hear that Android users started encountering this last year. This is a huge turn-off for me and I’m sure many others. King, please rethink this. I’ve been playing for years and this just might make me quit!  EDIT: Have uninstalled it from my phone.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5252672012","userName":"Amba692","userUrl":"https://itunes.apple.com/us/reviews/id234858735","version":"1.165.2","score":1,"title":"Finding new ways to ruin game","text":"Over the years owners of the game kept finding ways to make game progress more and more frustrating in an effort to goad players to spend money.   Which I did a bit as to reward an entertaining game.    But finally they outdid themselves removing ability to preview and reset game board without losing boosters and lives.  \nSo now I can say, go and screw yourself.    Time to find another game to play.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5252464265","userName":"TSizzler101","userUrl":"https://itunes.apple.com/us/reviews/id1108818520","version":"1.165.2","score":1,"title":"Awful update","text":"The new update makes the game much less enjoyable. Losing a life if you exit a level without making a move was not a good decision.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5252339189","userName":"Goddess78","userUrl":"https://itunes.apple.com/us/reviews/id158700632","version":"1.165.2","score":1,"title":"No more resting the board","text":"We no longer can reset the board for a better chance at getting through levels. I’ll admit I was spending way to much buying bars to make it through games, even with this option. They will be losing a considerable amount from me now. I was really enjoying this game, but now it’s nothing short of pure frustration.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5252331414","userName":"Greatbullfrog","userUrl":"https://itunes.apple.com/us/reviews/id120903585","version":"1.165.2","score":1,"title":"Don’t do it...","text":"Candy Crush was the ultimate in brain relaxation.  For at least 7 years I have used it to wake my brain up and to also put it to sleep. Recently they updated it to remove a strategic shuffle that is absolutely required when you get into higher levels (3k and above). It has rendered the game frustrating. As a long time, loyal app user, I have abandoned the game.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5252322140","userName":"Naaaaaanccy","userUrl":"https://itunes.apple.com/us/reviews/id558699387","version":"1.165.2","score":1,"title":"Used to be fun","text":"This used to be a fun game. Now the developers have “fixed” what they considered a problem. You can now not back out of a game without losing a life. This has taken the fun out of the game. I will more spend my time AND money elsewhere.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5252069982","userName":"chuck0813","userUrl":"https://itunes.apple.com/us/reviews/id688242850","version":"1.165.2","score":1,"title":"Hacked","text":"Lost all my boosters for the 2nd time, I’m done playing this game.","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5251885814","userName":"Mya Bell","userUrl":"https://itunes.apple.com/us/reviews/id679243729","version":"1.165.2","score":1,"title":"Hate the Changes","text":"I used to be an everyday player for years, but ever since they disabled the reset option for the boards, I became less enthused about playing and stopped. You should’ve kept it how it was. 😒","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"},{"id":"5251525958","userName":"nigerian angel","userUrl":"https://itunes.apple.com/us/reviews/id1108730775","version":"1.165.2","score":5,"title":"Candy Delught","text":"This is a great game for the elderly to play for relaxation. Thank you!!!","url":"https://itunes.apple.com/us/review?id=553834731&type=Purple%20Software"}]